#coding:utf8


def code_date_to_dict(code, content=None):
    if isinstance(content, list):
        data = {'list': content}
    elif content:
        pass
    else:
        content = {}
    return {
        'code': code,
        'desc': err_code[code],
        'content': content
    }


err_code = {
    "10000": u"成功",
    "10001": u"phone或token参数缺失",
    "10002": u"phone和token不对应或不存在",
    "10003": u"token失效",
    "10004": u"您的账户已被迁移到菠萝理财存管版，请用菠萝理财存管版登录！",
    "10005": u"用户已被拉入黑名单",
    "10006": u"密码输入有误",
    "10007": u"用户未激活",
    "10008": u"用户未注册",
    "10009": u"密码为空",
    "20001": u"用户已注册",
    "30001": u"不满18周岁，不能绑卡",
    "30002": u"身份证号位数不对",
    "30003": u"身份证已绑定",
    "30004": u"银行卡已绑定",
    "30005": u"身份证非法绑定",
    "30006": u"银行卡非法绑定",
    "30007": u"银行卡logo不存在",
    "30008": u"真实姓名不能为空",
    "30009": u"身份证号码不能为空",
    "30010": u"银行卡号不能为空",
    "30011": u"银行名不能为空",
    "30012": u"银行卡类型不能为空",
    "30013": u"所在省份不为空",
    "30014": u"所在城市不为空",
    "30015": u"银行卡验证接口请求失败",
    "30016": u"网络错误",
    "30017": u"邮箱不能为空",
    "30018": u"两次输入密码不相同",
    "30019": u"旧密码输入错误",
    "30020": u"用户取消授权调用失败",
    "30021": u"用户取消授权业务处理失败",
    "30022": u"银行卡未绑定",
    "30023": u"解绑银行卡业务处理失败",
    "30024": u"解绑银行卡调用接口失败",
    "40001": u"邀请链接无效",
    "40002": u"推荐人不能是自己",
    "40003": u"推荐人的手机号不存在",
    "40004": u"手机号不能为空",
    "50001": u"没有可用抽奖次数",
    "60001": u"没有可用抽奖次数",
    "60002": u"红包起投金额不能为空",
    "60003": u"该用户没有未使用红包",
    "70001": u"充值最小金额为1元",
    "70002": u"支付遇到网络错误",
    "70003": u"该银行卡号bin信息查询有误",
    "70004": u"操作异常",
    "70005": u"交易失败,用户不存在",
    "70006": u"交易失败",
    "80001": u"提现金额不能为空",
    "80002": u"您的账户已被迁移到菠萝理财存管版，请用菠萝理财存管版登录！",
    "80003": u"未绑定银行卡",
    "80004": u"交易密码为空，请先设置交易密码",
    "80005": u"交易密码不正确",
    "80006": u"银行卡编码不匹配",
    "80007": u"提现的金额大于可用余额",
    "80008": u"最小提现金额100",
    "80009": u"提现的所产生利息大于可用余额",
}